{"version":"https://jsonfeed.org/version/1.1","title":"Abouts on Ben Sycha","home_page_url":"https://ben.sycha.uk/about/","feed_url":"https://ben.sycha.uk/about/feed.json","authors":[{"name":"Ben Sycha"}],"items":[{"title":"Me","id":"https://ben.sycha.uk/about/me/","url":"https://ben.sycha.uk/about/me/","summary":"Hi Hello! I am Ben a tech enthusiast, optimistic project starter, wheelchair rugby coach and parent. I also happen to be neurodivergent [ND].\nWhat does my life look like? In the week when the kids are at school I am a work from home DevOps/Software developer in a startup who uses his ADHD powers to learn platforms and techniques quickly, and then uses his ASD powers to organise and analyse code and deployments.","content_html":"\u003ch2 id=\"hi-hello\"\u003eHi Hello!\u003c/h2\u003e\n\u003cp\u003eI am Ben a tech enthusiast, optimistic project starter, wheelchair rugby coach and parent. I also happen to be neurodivergent [ND].\u003c/p\u003e\n\u003ch3 id=\"what-does-my-life-look-like\"\u003eWhat does my life look like?\u003c/h3\u003e\n\u003cp\u003eIn the week when the kids are at school I am a work from home DevOps/Software developer in a startup who uses his ADHD powers to learn platforms and techniques quickly, and then uses his ASD powers to organise and analyse code and deployments. I also inflict bad puns on co-workers.\u003c/p\u003e\n\u003cp\u003eBefore and after work I am Dad{,dy} to my two ND kids, trying to find new way to assist them in finding adaptations to life to keep them regulated and happy. As well as usual parenting stuff, bad jokes, imagination games, listening to lots and lots of talk about minecraft.\u003c/p\u003e\n\u003cp\u003eOn the weekend I am coach to the Berkshire Banshees wheelchair rugby team. I have been involved with the club since 2019, originally making up number if they were short of players and changing the odd tyre. Things snowballed from there, I became the head coach in 2021 and in 2022 I was awarded my Level 2 wheelchair rugby coaching certificate.\u003c/p\u003e\n\u003cp\u003eThe club and team are a great group of people who support each other and put the work in. We came second in division 2 (end of 2022) having only just won division 1 the season before, which was our first competitive season! Very proud of the Banshees.\u003c/p\u003e\n\u003cp\u003eWhile I am not working, parenting or coaching I will usually be working on a technical/making project. I have a few 3d printers, design things in CAD, self-host some services, build electronics and automate the house using home assistant.\u003c/p\u003e\n","image":"https://ben.sycha.uk/about/me/about-me.jpg","date_published":"0001-01-01T00:00:00Z"},{"title":"The site","id":"https://ben.sycha.uk/about/site/","url":"https://ben.sycha.uk/about/site/","summary":"What will you find here? Well I just started the site sooo a grow collection of techy project write ups, life thoughts and blog posts.\nWould you like to know more? The only good bug is a dead bug. Starship Troopers (1997)\nThough actually I am environmentally conscious so don\u0026rsquo;t actually kill all the bugs as they are important to our ecosystem and us all not dying. Except wasps, I hate wasps.","content_html":"\u003ch3 id=\"what-will-you-find-here\"\u003eWhat will you find here?\u003c/h3\u003e\n\u003cp\u003eWell I just started the site sooo a grow collection of techy project write ups, life thoughts and blog posts.\u003c/p\u003e\n\u003ch3 id=\"would-you-like-to-know-more\"\u003eWould you like to know more?\u003c/h3\u003e\n\u003cblockquote\u003e\n\u003cp\u003eThe only good bug is a dead bug. \u003c!-- raw HTML omitted --\u003eStarship Troopers (1997)\u003c!-- raw HTML omitted --\u003e\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eThough actually I am environmentally conscious so don\u0026rsquo;t actually kill all the bugs as they are important to our ecosystem and us all not dying. Except wasps, I hate wasps. Yes wasps are important too but it is really hard to admit that they are important as they make me really uncomfortable.\u003c/p\u003e\n\u003ch3 id=\"content-style\"\u003eContent Style\u003c/h3\u003e\n\u003cp\u003eWill there be the occasional tangent? Yes, could I cut them out? probably. do I want to? not really at the moment. The aim is to communicate subjects I find interesting with my personality embedded in the content.\u003c/p\u003e\n\u003ch3 id=\"is-this-site-perfect\"\u003eIs this site perfect?\u003c/h3\u003e\n\u003cp\u003eNo, and that is something I am trying to work on accepting. Does it do the job yes. Can I make it better later yes. Would I ever push deploy if I waited until it was perfect? Most likely not.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eDone is better than perfect because perfect is never done\u003c/p\u003e\n\u003c/blockquote\u003e\n","date_published":"0001-01-01T00:00:00Z"}]}